{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "user_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3460], "dtype": "float32", "sparse": false, "name": "user_input"}, "inbound_nodes": []}, {"name": "item_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 919], "dtype": "float32", "sparse": false, "name": "item_input"}, "inbound_nodes": []}, {"name": "user_layer1", "class_name": "Dense", "config": {"name": "user_layer1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": "init_normal", "bias_initializer": "init_normal", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["user_input", 0, 0, {}]]]}, {"name": "item_layer1", "class_name": "Dense", "config": {"name": "item_layer1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": "init_normal", "bias_initializer": "init_normal", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["item_input", 0, 0, {}]]]}, {"name": "user_layer2", "class_name": "Dense", "config": {"name": "user_layer2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": "init_normal", "bias_initializer": "init_normal", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["user_layer1", 0, 0, {}]]]}, {"name": "item_layer2", "class_name": "Dense", "config": {"name": "item_layer2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": "init_normal", "bias_initializer": "init_normal", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["item_layer1", 0, 0, {}]]]}, {"name": "predict", "class_name": "Lambda", "config": {"name": "predict", "trainable": true, "dtype": "float32", "function": "cosine_similarity_relu", "function_type": "function", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["user_layer2", 0, 0, {}], ["item_layer2", 0, 0, {}]]]}], "input_layers": [["user_input", 0, 0], ["item_input", 0, 0]], "output_layers": [["predict", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}